---
kind: method
id: M:Autodesk.Revit.DB.ProjectLocationSet.Clear
source: html/d734eec8-1a7e-2192-84fb-0ca5bc64fc49.htm
---
# Autodesk.Revit.DB.ProjectLocationSet.Clear Method

Removes every project location from the set, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```